[中文简体]
FormDiagCaption=触摸屏诊断工具 v2.28 Beta10
GroupBox1=触摸屏状态
Label1=型号：
Label2=出厂日期：
Label3=出厂时间：
Label4=序列号：
Label5=硬件版本：
Label6=固件版本：
Label7=固件状态：
Label8=运行状态：
Button4=刷  新
Button6=切  换
Label39=参数CRC：
GroupBox2=参数设定
Label11=帧率：
Label12=单击灵敏度：
Label13=双击灵敏度：
CheckBoxFeatureSmooth=启用平滑
CheckBoxFeatureReverseX=x坐标对称变换
CheckBoxFeatureReverseY=y坐标对称变换
CheckBoxFeatureExchangeXY=交换xy坐标
CheckBoxFeatureUSARTOn=启用串口报告
CheckBoxFeatureSmallPointOn=小物体识别
Button7=读取
Button8=默认设置
Button9=设置
GroupBox3=校准
Label9=校准网格：
Label10=X
Label14=左：
Label15=上：
Label37=右：
Label38=下：
CheckBoxCalibAuxPoint=辅助校准点
Button10=恢复默认
Button11=开  始
Button12=多区校准
Button13=导 出
GroupBox4=诊断
Button1=诊    断
Button2=画点测试
Button3=信号查看
Button15=故障记录
Button5=发送报告
Label18=语 言
Label16=上海精研电子科技有限公司
Label17=http://www.irmtouch.com
FormSignal=信号
ChartSigX=长边信号（X）
ChartSigY=短边信号（Y）
PopupMenu1=记录信号
FormPoints=画点测试
PopupMenu21=画线
PopupMenu22=固定大小
FormImgDiag=诊断 
FormCalibPerform=校准效果
PanelConnect=触摸屏已连接！
PanelUnconnect=触摸屏已断开！
InvalidCalibData=校准数据无效！
InvalidParamLeft=距离屏幕左边缘像素设置超出范围
InvalidParamUp=距离屏幕上边缘像素设置超出范围
InvalidParamRight=距离屏幕右边缘像素设置超出范围
InvalidParamDown=距离屏幕下边缘像素设置超出范围
UseDefault=使用默认值
UserParamUnvalid=无法设置用户参数，可能固件版本过低!
ParamTooLarge=参数太多，需要修改程序！
DownloadFinish=下载完成!
DownloadWait=下载中，请稍后...;
FunctionNotValid=固件版本过低，不支持该功能!;
ResetDlgCap=清除校准数据
ResetConfirm1=确定清除校准数据吗？
ResetConfirm2=清除后，触摸点将恢复原始位置。
CalibrationFinished=校准完成！
CalibrationFalied=校准参数计算失败，请重新校准！
InvalidUserParam=参数读取成功,用户参数尚未设置！
ReadParamOK=参数读取成功！
APP_OK=正常
APP_Empty=空白
APP_Corrupt=损坏
APP_Unknown=未知
Sta_Run=正常
Sta_Stop=停止
Sta_Err=错误
CalibrateInfo=按ESC键或者两指触摸超过3秒取消并退出校准!
Recording=故障数据记录中...
CalibExportFile=校准参数文件(*.cfg)|*.cfg
CanNotCreateFile=无法创建文件！
ConfirmOverwrite1=文件已经存在，需要覆盖吗?
ConfirmOverwrite2=确认覆盖
CheckBoxWindowCalib=区域校准模式
Label19=左上角X坐标：
Label20=左上角Y坐标：
Label21=区域高度：
Label22=区域宽度：
ExtersionWanning=坐标拉伸将导致触摸定位有偏差！
CheckBoxEx=边缘坐标扩展
GroupBox5=校准点距离触摸边缘像素：
Label24=左侧：
Label25=右侧：
Label26=上边：
Label27=下边：
CheckBoxArea=屏蔽区域外触摸
Label31=显示器：
DisplayOrientation1=不旋转
DisplayOrientation2=顺时针旋转90°
DisplayOrientation3=旋转180°
DisplayOrientation4=逆时针旋转90°
TestSteps = 测试步骤：
TestStep1=1、断开USB连接待测PCBA。
TestStep2=2、连接USB等待测试指示灯变成黄色。
TestStep3=3、沿待测PCBA边缘慢速单指滑动。
TestStep4=4、按空格键可重新开始测试。
TestResults=测试结果：
TestResult1=测试未正常启动。
TestResult2=测试未完成，如无法完成，表明待测PCBA存在故障。
TestResult3=测试失败，待测PCBA存在故障。
TestResult4=测试通过，待测PCBA功能正常。
Faults=常见故障：
Fault1=1、整板信号低或无信号。
Fault2=2、某些灯信号低。
Fault3=3、多组灯同时低。
Fault4=4、某些灯信号低不下去。
FaultStatus=故障状态:
Emit=发射
Receive=接收
DiagnosticTitle1=诊断 - 触摸屏已连接！
DiagnosticTitle2=诊断 - 与触摸屏通讯超时！
Label36=设备路径:
MultiCalibFormCaption=多区域校准参数设定
MultiCalibTitle=平面展开示意图
Cell0=区号
Cell1=触摸区x0
Cell2=触摸区y0
Cell3=触摸区x1
Cell4=触摸区y1
Cell5=显示区x0
Cell6=显示区y0
Cell7=显示区x1
Cell8=显示区y1
MButton1=开 始
MButton2=刷 新
MButton3=保 存
MButton4=导 入
MButton5=添 加
MButton6=删 除
MLable20=触摸总长：
MLable1=触摸总宽：
MLable3=显示总长：
MLable4=显示总宽：
MLable10=显示x偏移：
MLable11=显示y偏移：
MLable8=区域数量：

[English]FormDiagCaption=Diagnostic Tools v2.28 Beta10
GroupBox1=Status
Label1=Model:
Label2=Ship Date:
Label3=Ship Time:
Label4=Serial:
Label5=Hardware Version:
Label6=Firmware Version:
Label7=Firmware Status:
Label8=Run Status:
Button4=Refresh
Button6=Stop / Run
Label39=Parameter CRC:
GroupBox2=Settings
Label11=Frames:
Label12=Click Sensitivity:
Label13=Double Click:
CheckBoxFeatureSmooth=Enable Smooth
CheckBoxFeatureReverseX=Reverse x
CheckBoxFeatureReverseY=Reverse y
CheckBoxFeatureExchangeXY=Swap x y
CheckBoxFeatureUSARTOn=Enable Serial Report
CheckBoxFeatureSmallPointOn=Small Point Identify
Button7=Read
Button8=Default
Button9=Set
GroupBox3=Calibration
Label9=Grid:
Label10=X
GroupBox5=Margin
Label14=Left:
Label15=Up:
Label37=Right:
Label38=Down:
CheckBoxCalibAuxPoint=AUX Calibrate Points
Button10=Reset
Button11=Start
Button12=Result
Button13=Export
GroupBox4=Diagnostic
Button1=Diagnose
Button2=Draw Test
Button3=Signal View
Button15=Data Record
Button5=Send Report
Label18=Language
Label16=Shanghai Jingyan Electronic Technology Co., Ltd.
Label17=http://www.irmtouch.com
FormSignal=Signal
ChartSigX=Long side signal（X）
ChartSigY=Short side signal（Y）
PopupMenu1=Record Data
FormPoints=Point Test 
PopupMenu21=DrawLine
PopupMenu22=FixSize
FormImgDiag=Diagnostic - Touch Panel Connect!
FormCalibPerform=Calibration Performance
PanelConnect=Touch Panel Connected!
PanelUnconnect=Touch Panel Unconnected!
InvalidCalibData=Invalid Calibration Data!
UserParamUnvalid=User parameter is NOT supported for this firmware version!
ParamTooLarge=Too many parameter!
DownloadFinish=Download finished!
DownloadWait=Downloading, Please wait...
FunctionNotValid=Function is NOT supported for this firmware version!
ResetDlgCap=Reset Calibration
ResetConfirm1=Sure to reset calibration data?
ResetConfirm2=Touch will back to original position after reset.
CalibrationFinished=Calibration finished!
CalibrationFalied=Caculate parameter failed. Please try again later.
InvalidParamLeft=Left margin setting is out of range
InvalidParamUp=Up margin setting is out of range
InvalidParamRight=Right margin setting is out of range
InvalidParamDown=Down margin setting is out of range
UseDefault=using default value
InvalidUserParam=Read user's parameter succeeded but it is NOT set.
ReadParamOK=Read parameter succeeded!
APP_OK=OK
APP_Empty=Empty
APP_Corrupt=Corrupt
APP_Unknown=Unknown
Sta_Run=OK
Sta_Stop=Stop
Sta_Err=Error
CalibrateInfo=Press 'ESC' key or dual-touch more than 3 seconds to exit!
Recording=Diagnostic Data Recording...
CalibExportFile=Calibration Parameter(*.cfg)|*.cfg
CanNotCreateFile=Can not create file！
ConfirmOverwrite1=File exist, overwrite?
ConfirmOverwrite2=Confirm
CheckBoxWindowCalib=Windows Calibration Mode
Label19=Window Offset x:
Label20=Window Offset y:
Label21=Window Height:
Label22=Window Width:
ExtersionWanning=Enable this feature will lower the positioning acuracy.
CheckBoxEx=Extension
GroupBox5=Margin
Label24=Left: 
Label25=Right: 
Label26=Up: 
Label27=Down: 
CheckBoxArea=Mask touch outof window
Label31=Display Orientation:
DisplayOrientation1=Landscape
DisplayOrientation2=portrait 
DisplayOrientation3=Landscape(flipped)
DisplayOrientation4=portrait(flipped)
TestSteps = Test Steps: 
TestStep1=1. Disconnect touchframe, connect PCBAs.
TestStep2=2. Connect touchframe, wait until test LEDs became yellow.
TestStep3=3. Slide along the PCBA edge inside touchframe slowly and using one finger.
TestStep4=4. Press space key to restart testing.
TestResults=Test results: 
TestResult1=Can not be normaly started.
TestResult2=Unfinished. If it can't be finished there must be something wrong on PCBA.
TestResult3=Fault.
TestResult4=Test passed.
Faults=Common faults: 
Fault1=1. Entire PCBA's signal is too low.
Fault2=2. Some signals are too low.
Fault3=3. Groups of signals are too low.
Fault4=4. Some signals can not be blocked.
FaultStatus=Fault status:
Emit=Emit
Receive=Receive
DiagnosticTitle1=Diagnostic - Touch frame connected!
DiagnosticTitle2=Diagnostic - Touch frame disconnected!
Label36=Device Path:

[中文繁体]
FormDiagCaption=觸摸屏診斷工具 v2.28 Beta7
GroupBox1=觸摸屏狀態
Label1=型號：
Label2=出廠日期：
Label3=出廠時間：
Label4=序列號：
Label5=硬件版本：
Label6=固件版本：
Label7=固件狀態：
Label8=運行狀態：
Button4=刷  新
Button6=切  換
Label39=參數CRC：
GroupBox2=參數設定
Label11=幀率：
Label12=單擊靈敏度：
Label13=雙擊靈敏度：
CheckBoxFeatureSmooth=啟用平滑
CheckBoxFeatureReverseX=x坐標對稱變換
CheckBoxFeatureReverseY=y坐標對稱變換
CheckBoxFeatureExchangeXY=交換xy坐標
CheckBoxFeatureUSARTOn=啟用串口報告
CheckBoxFeatureSmallPointOn=小物體識別
Button7=讀取
Button8=默認設置
Button9=設置
GroupBox3=校準
Label9=校準網格：
Label10=X
Label14=左：
Label15=上：
Label37=右：
Label38=下：
CheckBoxCalibAuxPoint=輔助校準點
Button10=恢復默認
Button11=開  始
Button12=校準效果
Button13=導 出
GroupBox4=診斷
Button1=診    斷
Button2=畫點測試
Button3=信號查看
Button15=故障記錄
Button5=發送報告
Label18=語 言
Label16=上海精研電子科技有限公司
Label17=http://www.irmtouch.com
FormSignal=信號
ChartSigX=長邊信號（X）
ChartSigY=短邊信號（Y）
PopupMenu1=記錄信號
FormPoints=畫點測試
PopupMenu21=畫線
PopupMenu22=固定大小
FormImgDiag=診斷 
FormCalibPerform=校準效果
PanelConnect=觸摸屏已連接！
PanelUnconnect=觸摸屏已斷開！
InvalidCalibData=校準數據無效！
InvalidParamLeft=距離屏幕左邊緣像素設置超出範圍
InvalidParamUp=距離屏幕上邊緣像素設置超出範圍
InvalidParamRight=距離屏幕右邊緣像素設置超出範圍
InvalidParamDown=距離屏幕下邊緣像素設置超出範圍
UseDefault=使用默認值
UserParamUnvalid=無法設置用戶參數，可能固件版本過低!
ParamTooLarge=參數太多，需要修改程序！
DownloadFinish=下載完成!
DownloadWait=下載中，請稍後...;
FunctionNotValid=固件版本過低，不支持該功能!;
ResetDlgCap=清除校準數據
ResetConfirm1=確定清除校準數據嗎？
ResetConfirm2=清除後，觸摸點將恢復原始位置。
CalibrationFinished=校準完成！
CalibrationFalied=校準參數計算失敗，請重新校準！
InvalidUserParam=參數讀取成功,用戶參數尚未設置！
ReadParamOK=參數讀取成功！
APP_OK=正常
APP_Empty=空白
APP_Corrupt=損壞
APP_Unknown=未知
Sta_Run=正常
Sta_Stop=停止
Sta_Err=錯誤
CalibrateInfo=按ESC鍵或者兩指觸摸超過3秒取消並退出校準!
Recording=故障數據記錄中...
CalibExportFile=校準參數文件(*.cfg)|*.cfg
CanNotCreateFile=無法創建文件！
ConfirmOverwrite1=文件已經存在，需要覆蓋嗎?
ConfirmOverwrite2=確認覆蓋
CheckBoxWindowCalib=區域校準模式
Label19=左上角X坐標：
Label20=左上角Y坐標：
Label21=區域高度：
Label22=區域寬度：
ExtersionWanning=坐標拉伸將導致觸摸定位有偏差！
CheckBoxEx=邊緣坐標擴展
GroupBox5=校準點距離觸摸邊緣像素：
Label24=左側：
Label25=右側：
Label26=上邊：
Label27=下邊：
CheckBoxArea=屏蔽區域外觸摸
Label31=顯示器：
DisplayOrientation1=不旋轉
DisplayOrientation2=順時針旋轉90°
DisplayOrientation3=旋轉180°
DisplayOrientation4=逆時針旋轉90°
TestSteps = 測試步驟：
TestStep1=1、斷開USB連接待測PCBA。
TestStep2=2、連接USB等待測試指示燈變成黃色。
TestStep3=3、沿待測PCBA邊緣慢速單指滑動。
TestStep4=4、按空格键可重新开始测试。
TestResults=測試結果：
TestResult1=測試未正常啟動。
TestResult2=測試未完成，如無法完成，表明待測PCBA存在故障。
TestResult3=測試失敗，待測PCBA存在故障。
TestResult4=測試通過，待測PCBA功能正常。
Faults=常見故障：
Fault1=1、整板信號低或無信號。
Fault2=2、某些燈信號低。
Fault3=3、多組燈同時低。
Fault4=4、某些燈信號低不下去。
FaultStatus=故障狀態:
Emit=發射
Receive=接收
DiagnosticTitle1=診斷 - 觸摸屏已連接！
DiagnosticTitle2=診斷 - 與觸摸屏通訊超時！
Label36=設備路徑:


[Default]
Language=中文简体
